## LETS LEARN PANDAS

In [1]:
import pandas as pd

In [2]:
pd.Series(["hello" , 1,2,3,34])

0    hello
1        1
2        2
3        3
4       34
dtype: object

In [3]:
n = pd.Series([1,2,3,4])

In [10]:
a = pd.Series([n , n1])

In [11]:
n1 = pd.Series(["asdf",1.2,3,4])

In [12]:
a[0][0]

np.int64(1)

In [13]:
a

0             0    1
1    2
2    3
3    4
dtype: int64
1    0    asdf
1     1.2
2       3
3       4
dtype:...
dtype: object

In [14]:
 n = pd.DataFrame({"hello":n,"hello1":n})

In [15]:
n

   hello  hello1
0      1       1
1      2       2
2      3       3
3      4       4

In [16]:
n2 = pd.DataFrame({"hi1":n})

ValueError: If using all scalar values, you must pass an index

In [17]:
n2

NameError: name 'n2' is not defined

In [40]:
print(n2)

                                                 hi1  \
0           0    1
1    2
2    3
3    4
dtype: int64
1  0    asdf
1     1.2
2       3
3       4
dtype:...

                                                 hi2
0           0    1
1    2
2    3
3    4
dtype: int64
1  0    asdf
1     1.2
2       3
3       4
dtype:...

In [66]:
n3 = pd.DataFrame({"t0":n , "t1":n})
n3

   t0  t1
0   1   1
1   2   2
2   3   3
3   4   4

In [65]:
pd.DataFrame({"t0":n , "t1":n })

   t0  t1
0   1   1
1   2   2
2   3   3
3   4   4

In [60]:
type(pd.read_csv('car-sales.csv'))

pandas.core.frame.DataFrame

In [61]:
type(n3)

pandas.core.frame.DataFrame

In [68]:
n3

   t0  t1
0   1   1
1   2   2
2   3   3
3   4   4

In [72]:
n3['t0']

0    1
1    2
2    3
3    4
Name: t0, dtype: int64

In [75]:
n3.to_csv("yobro.csv" , index=False)

In [76]:
n3.dtypes

t0    int64
t1    int64
dtype: object

# PANDAS DAY2

In [18]:
import pandas as pd

In [20]:
data = pd.read_csv("car-sales.csv")

In [21]:
data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [22]:
heart = pd.read_csv("heart-disease.csv")

In [23]:
heart

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0